docs/2020-03-25-0928 Integration with org-link.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-09-21 Wed 22:53 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Integration with org-link</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='static/style.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<div id='head'>
    <h1><b>zd-tutorial</b></h1>
    &mdash;
    <ul>
        <li><a href='./2020-02-15-1247 Welcome.html'>Welcome</a></li>
        <li><a href='./2022-09-21-2228 Index of all notes in zd-tutorial.html'>Index</a></li>
        <li><a href='https://efls.github.io/zetteldeft'
	       style='float: right'>Zetteldeft</a></li>
    </ul>
</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Integration with org-link</h1>
</header><p>
Backlink: <a href="./2020-04-17-1605 Expansions HUB.html">ยง2020-04-17-1605</a> Expansions HUB
</p>

<p>
For further integration with <code>org-mode</code>, we can create a new type of link.
Let&rsquo;s call it <code>zdlink</code>.
</p>

<p>
Links should be formatted like so: <code>[[zdlink:2020-04-17-1605][link]]</code>.
Which results in the following .
</p>

<p>
Please <b>note</b>: Deft should be loaded for this to work.
</p>

<p>
First, we define <code>org-link</code> parameters.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-link-set-parameters
  <span style="color: #2544bb;">"zdlink"</span>
  <span style="color: #8f0075; font-weight: bold;">:follow</span> (<span style="color: #5317ac; font-weight: bold;">lambda</span> (str) (zetteldeft--search-filename (zetteldeft--lift-id str)))
  <span style="color: #8f0075; font-weight: bold;">:complete</span> 'efls/zd-complete-link
  <span style="color: #8f0075; font-weight: bold;">:help-echo</span> <span style="color: #2544bb;">"Searches provided ID in zetteldeft"</span>)
</pre>
</div>

<p>
This tells <code>org</code> about a new type of link and what to do with it:
find a zetteldeft ID in the link string, and search for it.
</p>

<p>
This means that the link will work as long as there is a zetteldeft-id-regex in it,
which implies that this, too, will work: <code>[[zdlink:2020-04-17-1605 Expansions HUB.org][link]]</code>.
</p>

<p>
To tell Zetteldeft to (almost) always insert these Org styled links, set the variable <code>zetteldeft-insert-link-function</code> to <code>zetteldeft-insert-link-org-style</code>.
</p>

<p>
For convenience, we can also create a small completion function to facilitate inserting links with the <code>org-insert-link</code> function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #5317ac; font-weight: bold;">defun</span> <span style="color: #721045;">efls/zd-complete-link</span> ()
  <span style="color: #2a486a;">"Link completion for `</span><span style="color: #0000c0;">zdlink</span><span style="color: #2a486a;">' type links"</span>
  (<span style="color: #5317ac; font-weight: bold;">let*</span> ((file (completing-read <span style="color: #2544bb;">"File to link to: "</span>
                (deft-find-all-files-no-prefix)))
         (link (zetteldeft--lift-id file)))
     (<span style="color: #5317ac; font-weight: bold;">unless</span> link (<span style="color: #813e00; font-weight: bold;">user-error</span> <span style="color: #2544bb;">"No file selected"</span>))
     (concat <span style="color: #2544bb;">"zdlink:"</span> link)))
</pre>
</div>

<p>
Now when <code>org-insert-link</code> is called, simply select <code>zdlink</code> from the list, and a completion window will pop up.
</p>
</div>
</body>
</html>
